/**
 * Created by Maven Hyun on 2017-04-20.
 */
public class BatResult
{

    String score;
    boolean flag = false;
    boolean home;

    String [][] table = new String[][]
            {
                    {"이름", "타석1", "타석2", "타석3", "타석4", "타석5", "타석6", "타석7", "타석8", "타석9"},
                    {"1번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"},
                    {"2번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"},
                    {"3번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"},
                    {"4번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"},
                    {"5번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"},
                    {"6번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"},
                    {"7번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"},
                    {"8번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"},
                    {"9번타자", "결과", "결과", "결과","결과","결과","결과","결과","결과","결과"}
            };

    public void switch_hole(String p1, Integer n1, Integer n2)
    {
        if (table[n1][0].contains(p1))
        {
            String[] row = new String[10];
            row = table[n1];
            table[n1] = table[n2];
            table[n2] = row;
            flag = true;
        }
    }
}


